Anyc-Qing/AUTOSAR/core/mcal/Port/inc/MPC5646B_portdefs.h
/*-------------------------------- Arctic Core ------------------------------
 * Copyright (C) 2013, ArcCore AB, Sweden, www.arccore.com.
 * Contact: <contact@arccore.com>
 *
 * You may ONLY use this file:
 * 1)if you have a valid commercial ArcCore license and then in accordance with
 * the terms contained in the written license agreement between you and ArcCore,
 * or alternatively
 * 2)if you follow the terms found in GNU General Public License version 2 as
 * published by the Free Software Foundation and appearing in the file
 * LICENSE.GPL included in the packaging of this file or here
 * <http://www.gnu.org/licenses/old-licenses/gpl-2.0.txt>
 *-------------------------------- Arctic Core -----------------------------*/

#ifndef _MPC5646BPORTS_H
#define _MPC5646BPORTS_H
/* 176 LQFP */

/* Pad: 0*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_0 {21, 2}  /* E0UC[13] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU0_PAD_0 {38, 0}  /* E0UC[0] / eMIOS_0 */
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_ICU0 PORT_FUNC1
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER1 PORT_FUNC3
#define PIN_FUNCTION_REG_0_PORT_PIN_MODE_OTHER2 PORT_FUNC0

/* Pad: 1*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_1 {39, 0}  /* E0UC[1] / eMIOS_0 */
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_1_PORT_PIN_MODE_OTHER1 PORT_FUNC0

/* Pad: 2*/
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_ADC PORT_FUNC3
#define PIN_FUNCTION_REG_2_PORT_PIN_MODE_OTHER0 PORT_FUNC0

/* Pad: 3*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_3 {13, 0}  /* E1UC[3] / eMIOS_0 */
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_3_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC

/* Pad: 4*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_4 {14, 0}  /* E0UC[4] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_4 {60, 0}  /* LIN5RX / LINFlex _5 */
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_LIN PORT_FUNC0
#define PIN_FUNCTION_REG_4_PORT_PIN_MODE_OTHER0 PORT_FUNC01

/* Pad: 5*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_5 {15, 0}  /* E0UC[5] / eMIOS_0 */
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_5_PORT_PIN_MODE_LIN PORT_FUNC2

/* Pad: 6*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_6 {16, 0}  /* E0UC[6] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_6 {59, 0}  /* LIN4RX / LINFlex _4Reserved */
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_6_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 7*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_7 {17, 0}  /* E0UC[7] / eMIOS_0 */
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_7_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC

/* Pad: 8*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_8 {22, 2}  /* E0UC[14] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_8 {31, 0}  /* LIN3RX / LINFlex_3 */
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER0 PORT_FUNC2  /* Can be used for PWM and ICU */
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_OTHER2 PORT_FUNC0
#define PIN_FUNCTION_REG_8_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 9*/
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_9_PORT_PIN_MODE_OTHER0 PORT_FUNC0

/* Pad: 10*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_10 {18, 0}  /* E0UC[10] / eMIOS_0 */
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_LIN PORT_FUNC3
#define PIN_FUNCTION_REG_10_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC

/* Pad: 11*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_11 {19, 0}  /* E0UC[11] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_11 {58, 1}  /* LIN2RX / LINFlex _2 */
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_LIN PORT_FUNC0
#define PIN_FUNCTION_REG_11_PORT_PIN_MODE_OTHER2 PORT_GPIO_APC

