Anyc-Qing/AUTOSAR/core/mcal/Port/inc/MPC5646B_portdefs.h
/* Pad: 12*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_12 {40, 0}  /* E0UC[28] / eMIOS_0 */
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_12_PORT_PIN_MODE_SPI0 PORT_FUNC0

/* Pad: 13*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_13 {41, 0}  /* E0UC[29] / eMIOS_0 */
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_13_PORT_PIN_MODE_OTHER PORT_FUNC2


/* Pad: 14*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_14 {5, 0}  /* SCK_0 / DSPI_0 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI0_PAD_14 {6, 0}  /* CS0_0 / DSPI_0 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_14 {38, 1}  /* E0UC[0] / eMIOS_0 */
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_SPI0 PORT_FUNC2
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_14_PORT_PIN_MODE_OTHER1 PORT_FUNC0

/* Pad: 15 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_15 {5, 1}  /* SCK_0 / DSPI_0 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI0_PAD_15 {6, 1}  /* CS0_0 / DSPI_0 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_15 {39, 1}  /* E0UC[1] / eMIOS_0 */
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_SPI0 PORT_FUNC1
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_15_PORT_PIN_MODE_OTHER1 PORT_FUNC0

/* Pad: 16*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_16 {42, 0}  /* E0UC[30] / eMIOS_0 */
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_16_PORT_PIN_MODE_LIN PORT_FUNC3

/* Pad: 17*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_17 {43, 0}  /* E0UC[31] / eMIOS0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_17 {62, 1}  /* LIN0RX/LINFlexD_0 */
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_17_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 18*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_18 {42, 1}  /* E0UC[30] / eMIOS_0 */
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_18_PORT_PIN_MODE_OTHER0 PORT_FUNC3

/* Pad: 19*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_19 {43, 1}  /* E0UC[31] / eMIOS0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_19 {62, 0}  /* LIN0RX/LINFlexD_0 */
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_19_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 20*/
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_20_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 21*/
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_21_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 22*/
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_22_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 23*/
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_23_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 24*/
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_24_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC

/* Pad: 25*/
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_25_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC

/* Pad: 26*/
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_26_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC

/* Pad: 27*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_27 {6, 2}  /* CS0_0 / DSPI_0 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_27 {13, 1}  /* E1UC[3] / eMIOS_0 */
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_27_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

