Anyc-Qing/AUTOSAR/core/mcal/Port/inc/MPC5646B_portdefs.h
/* Pad: 28*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_28 {14, 1}  /* E0UC[4] / eMIOS_0 */
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_28_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 29*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_29 {15, 1}  /* E0UC[5] / eMIOS_0 */
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_29_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 30*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_30 {16, 1}  /* E0UC[6] / eMIOS_0 */
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_30_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 31*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_31 {17, 1}  /* E0UC[7] / eMIOS_0 */
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_31_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 32*/
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_32_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 33*/
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_33_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 34*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_34 {7, 0}  /* SCK_1 / DSPI_1 */
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_34_PORT_PIN_MODE_OTHER1 PORT_FUNC0

/* Pad: 35*/
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_35 {0, 0}  /* CAN1RX / FlexCAN_1 */
#define INPUT_SELECT_PORT_PIN_MODE_CAN0_PAD_35 {3, 0}  /* CAN4RX / FlexCAN_4 */
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_ADC PORT_FUNC2
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_35_PORT_PIN_MODE_CAN0 PORT_FUNC0

/* Pad: 36*/
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_36 {2, 0}  /* CAN3RX / FlexCAN_3 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_36 {8, 0}  /* SIN_1 / DSPI_1 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_36 {57, 0}  /* E1UC[31] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_SPI PORT_FUNC0
#define PIN_FUNCTION_REG_36_PORT_PIN_MODE_CAN PORT_FUNC0

/* Pad: 37*/
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_CAN PORT_FUNC2
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_37_PORT_PIN_MODE_OTHER0 PORT_FUNC0

/* Pad: 38*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_38 {54, 0}  /* E1UC[28] / eMIOS_1 */
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_38_PORT_PIN_MODE_OTHER0 PORT_FUNC3

/* Pad: 39*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_39 {55, 0}  /* E1UC[29] / eMIOS_1 */
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_LIN PORT_FUNC0
#define PIN_FUNCTION_REG_39_PORT_PIN_MODE_OTHER1 PORT_FUNC00

/* Pad: 40*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_40 {13, 2}  /* E1UC[3] / eMIOS_0 */
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_40_PORT_PIN_MODE_OTHER0 PORT_FUNC3

/* Pad: 41*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_41 {17, 2}  /* E0UC[7] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_41 {58, 0}  /* LIN2RX / LINFlex _2 */
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER0 PORT_FUNC3
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_41_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 42*/
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_CAN0 PORT_FUNC2
#define PIN_FUNCTION_REG_42_PORT_PIN_MODE_ADC PORT_FUNC3

/* Pad: 43*/
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_43 {0, 1}  /* CAN1RX / FlexCAN_1 */
#define INPUT_SELECT_PORT_PIN_MODE_CAN0_PAD_43 {3, 1}  /* CAN4RX / FlexCAN_4 */
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_ADC PORT_FUNC3
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_43_PORT_PIN_MODE_CAN0 PORT_FUNC0

