Anyc-Qing/AUTOSAR/core/mcal/Port/inc/MPC5646B_portdefs.h
/* Pad: 44*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_44 {11, 0}  /* SIN_2 / DSPI_2 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_44 {20, 0}  /* E0UC[12] / eMIOS_0 */
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_44_PORT_PIN_MODE_SPI PORT_FUNC0

/* Pad: 45*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_45 {21, 0}  /* E0UC[13] / eMIOS_0 */
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_45_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 46*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_46 {10, 0}  /* SCK_2 / DSPI_2 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_46 {22, 0}  /* E0UC[14] / eMIOS_0 */
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_46_PORT_PIN_MODE_OTHER1 PORT_FUNC0

/* Pad: 47*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_47 {12, 0}  /* CS0_2 / DSPI_2 */
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_47_PORT_PIN_MODE_OTHER0 PORT_FUNC0

/* Pad: 48*/
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC
#define PIN_FUNCTION_REG_48_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC

/* Pad: 49*/
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER PORT_FUNC0
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC		/* routed to ADC0 & ADC1 P6 */
#define PIN_FUNCTION_REG_49_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC		/* routed to ADC0 & ADC1 P6 */

/* Pad: 50*/
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_OTHER PORT_GPIO_APC		/* routed to ADC0 & ADC1 P7 */
#define PIN_FUNCTION_REG_50_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC		/* routed to ADC0 & ADC1 P7 */

/* Pad: 51*/
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_51_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 52*/
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_52_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 53*/
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_53_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 54*/
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_54_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 55*/
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_55_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 56*/
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_56_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 57*/
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_57_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 58*/
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_58_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 59*/
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_59_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 60*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_60 {25, 0}  /* E0UC[24] / eMIOS_0 */
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_60_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 61*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_61 {9, 1}  /* CS0_1 / DSPI_1 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_61 {26, 0}  /* E0UC[25] / eMIOS_0 */
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_61_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 62*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_62 {27, 0}  /* E0UC[26] / eMIOS_0 */
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_62_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 63*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_63 {28, 0}  /* E0UC[27] / eMIOS_0 */
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_63_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 64*/
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_64 {4, 0}  /* CAN5RX / FlexCAN_5 */
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_64_PORT_PIN_MODE_CAN PORT_FUNC0

