Anyc-Qing/AUTOSAR/core/mcal/Port/inc/MPC5646B_portdefs.h
/* Pad: 65*/
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_65_PORT_PIN_MODE_CAN PORT_FUNC2

/* Pad: 66*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_66 {8, 1}  /* SIN_1 / DSPI_1 */
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_66_PORT_PIN_MODE_SPI PORT_FUNC0

/* Pad: 67*/
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_67_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 68*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_68 {7, 1}  /* SCK_1 / DSPI_1 */
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_68_PORT_PIN_MODE_OTHER1 PORT_FUNC0

/* Pad: 69*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_69 {9, 2}  /* CS0_1 / DSPI_1 */
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_69_PORT_PIN_MODE_ADC PORT_FUNC3

/* Pad: 70*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_70 {23, 0}  /* E0UC[22] / eMIOS_0 */
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_ADC PORT_FUNC3
#define PIN_FUNCTION_REG_70_PORT_PIN_MODE_OTHER0 PORT_FUNC0

/* Pad: 71*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_71 {24, 0}  /* E0UC[23] / eMIOS_0 */
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_ADC PORT_FUNC3
#define PIN_FUNCTION_REG_71_PORT_PIN_MODE_OTHER0 PORT_FUNC0

/* Pad: 72*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_72 {23, 1}  /* E0UC[22] / eMIOS_0 */
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_72_PORT_PIN_MODE_CAN0 PORT_FUNC3

/* Pad: 73*/
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_73 {1, 0}  /* CAN2RX / FlexCAN_2 */
#define INPUT_SELECT_PORT_PIN_MODE_CAN0_PAD_73 {2, 1}  /* CAN3RX / FlexCAN_3 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_73 {24, 1}  /* E0UC[23] / eMIOS_0 */
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_73_PORT_PIN_MODE_CAN0 PORT_FUNC0

/* Pad: 74*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_74 {56, 0}  /* E1UC[30] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_LIN PORT_FUNC1
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER PORT_FUNC3
#define PIN_FUNCTION_REG_74_PORT_PIN_MODE_OTHER0 PORT_FUNC0

/* Pad: 75*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_75 {25, 2}  /* E0UC[24] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_75 {31, 1}  /* LIN3RX / LINFlex_3 */
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_LIN PORT_FUNC0
#define PIN_FUNCTION_REG_75_PORT_PIN_MODE_OTHER0 PORT_FUNC0

/* Pad: 76*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_76 {11, 1}  /* SIN_2 / DSPI_2 */
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_SPI PORT_FUNC0
#define PIN_FUNCTION_REG_76_PORT_PIN_MODE_OTHER1 PORT_GPIO_APC

/* Pad: 77*/
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_77_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 78*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_78 {10, 1}  /* SCK_2 / DSPI_2 */
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER0 PORT_FUNC2
#define PIN_FUNCTION_REG_78_PORT_PIN_MODE_OTHER1 PORT_FUNC0

/* Pad: 79*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_79 {12, 1}  /* CS0_2 / DSPI_2 */
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_79_PORT_PIN_MODE_OTHER PORT_FUNC2

