Anyc-Qing/AUTOSAR/core/mcal/Port/inc/MPC5646B_portdefs.h
/* Pad: 80*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_80 {18, 1}  /* E0UC[10] / eMIOS_0 */
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_80_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 81*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_81 {19, 1}  /* E0UC[11] / eMIOS_0 */
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_81_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 82*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_82 {12, 2}  /* CS0_2 / DSPI_2 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_82 {20, 1}  /* E0UC[12] / eMIOS_0 */
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_82_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 83*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_83 {21, 1}  /* E0UC[13] / eMIOS_0 */
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_83_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 84*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_84 {22, 1}  /* E0UC[14] / eMIOS_0 */
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_84_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 85*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_85 {23, 2}  /* E0UC[22] / eMIOS_0 */
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_85_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 86*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_86 {24, 2}  /* E0UC[23] / eMIOS_0 */
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_86_PORT_PIN_MODE_OTHER0 PORT_GPIO_APC

/* Pad: 87*/
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_87_PORT_PIN_MODE_OTHER PORT_GPIO_APC

/* Pad: 88*/
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_88_PORT_PIN_MODE_CAN0 PORT_FUNC3

/* Pad: 89*/
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_89 {1, 1}  /* CAN2RX / FlexCAN_2 */
#define INPUT_SELECT_PORT_PIN_MODE_CAN0_PAD_89 {2, 2}  /* CAN3RX / FlexCAN_3 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_89 {44, 1}  /* E1UC[1] / eMIOS_1 */
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_89_PORT_PIN_MODE_CAN0 PORT_FUNC0

/* Pad: 90*/
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_90_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 91*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_91 {46, 1}  /* E1UC[3] / eMIOS_1 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_91 {59, 1}  /* LIN4RX / LINFlex _4Reserved */
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_91_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 92*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_92 {51, 0}  /* E1UC[25] / eMIOS_1 */
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_92_PORT_PIN_MODE_LIN PORT_FUNC2

/* Pad: 93*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_93 {52, 0}  /* E1UC[26] / eMIOS_1 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_93 {60, 1}  /* LIN5RX / LINFlex _5 */
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_93_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 94*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_94 {53, 0}  /* E1UC[27] / eMIOS_1 */
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_94_PORT_PIN_MODE_CAN0 PORT_FUNC3

/* Pad: 95*/
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_95 {0, 2}  /* CAN1RX / FlexCAN_1 */
#define INPUT_SELECT_PORT_PIN_MODE_CAN0_PAD_95 {3, 2}  /* CAN4RX / FlexCAN_4 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_95 {47, 1}  /* E1UC[4] / eMIOS_1 */
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_CAN PORT_FUNC0
#define PIN_FUNCTION_REG_95_PORT_PIN_MODE_CAN0 PORT_FUNC0

/* Pad: 96*/
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_CAN PORT_FUNC1
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_96_PORT_PIN_MODE_OTHER PORT_FUNC2

