Anyc-Qing/AUTOSAR/core/mcal/Port/inc/MPC5646B_portdefs.h
/* Pad: 97*/
#define INPUT_SELECT_PORT_PIN_MODE_CAN_PAD_97 {4, 1}  /* CAN5RX / FlexCAN_5 */
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_OTHER PORT_FUNC2
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_97_PORT_PIN_MODE_CAN PORT_FUNC0

/* Pad: 98*/
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_98_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 99*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_99 {34, 0}  /* CS0_3 / DSPI_3 */
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_99_PORT_PIN_MODE_OTHER0 PORT_FUNC0

/* Pad: 100*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_100 {32, 0}  /* SCK_3 / DSPI_3 */
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_100_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 101*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_101 {33, 0}  /* SIN_3 / DSPI_3 */
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_101_PORT_PIN_MODE_SPI PORT_FUNC0

/* Pad: 102*/
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_102_PORT_PIN_MODE_LIN PORT_FUNC2

/* Pad: 103*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_103 {56, 1}  /* E1UC[30] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER0 PORT_FUNC2 /* Can be used for PWM and ICU */
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_103_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 104*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_104 {12, 3}  /* CS0_2 / DSPI_2 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_104 {49, 0}  /* E1UC[17] / eMIOS_1 */
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_LIN PORT_FUNC2
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_104_PORT_PIN_MODE_OTHER0 PORT_FUNC0

/* Pad: 105*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_105 {10, 2}  /* SCK_2 / DSPI_2 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_105 {50, 0}  /* E1UC[18] / eMIOS_1 */
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_SPI PORT_FUNC3
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_OTHER1 PORT_FUNC0
#define PIN_FUNCTION_REG_105_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 106*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_106 {25, 1}  /* E0UC[24] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_106 {36, 0}  /* SIN_4 / DSPI_4Reserved */
#define INPUT_SELECT_PORT_PIN_MODE_ICU0_PAD_106 {57, 1}  /* E1UC[31] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_ICU0 PORT_FUNC2
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_OTHER0 PORT_FUNC2 /* Can be used for PWM and ICU */
#define PIN_FUNCTION_REG_106_PORT_PIN_MODE_SPI PORT_FUNC0

/* Pad: 107*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_107 {26, 1}  /* E0UC[25] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_107 {37, 0}  /* CS0_4 / DSPI_4Reserved */
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_107_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 108*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_108 {27, 1}  /* E0UC[26] / eMIOS_0 */
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_108_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 109*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_109 {28, 1}  /* E0UC[27] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_109 {35, 0}  /* SCK_4 / DSPI_4 */
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_109_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 110*/
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_110_PORT_PIN_MODE_LIN PORT_FUNC2

