Anyc-Qing/AUTOSAR/core/mcal/Port/inc/MPC5646B_portdefs.h
/* Pad: 111*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_111 {44, 0}  /* E1UC[1] / eMIOS_1 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_111 {61, 0}  /* LIN8RX / LINFlex _8 */
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_111_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 112*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_112 {8, 2}  /* SIN_1 / DSPI_1 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_112 {45, 0}  /* E1UC[2] / eMIOS_1 */
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_112_PORT_PIN_MODE_SPI PORT_FUNC0

/* Pad: 113*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_113 {46, 0}  /* E1UC[3] / eMIOS_1 */
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_113_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 114*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_114 {7, 2}  /* SCK_1 / DSPI_1 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_114 {47, 0}  /* E1UC[4] / eMIOS_1 */
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_114_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 115*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_115 {9, 3}  /* CS0_1 / DSPI_1 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_115 {48, 0}  /* E1UC[5] / eMIOS_1 */
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_115_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 116*/
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_116_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 117*/
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_117_PORT_PIN_MODE_OTHER PORT_FUNC1

/* Pad: 118*/
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_118_PORT_PIN_MODE_ADC PORT_FUNC3

/* Pad: 119*/
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_119_PORT_PIN_MODE_ADC PORT_FUNC3

/* Pad: 120*/
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_120_PORT_PIN_MODE_ADC PORT_FUNC3

/* Pad: 121*/
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_121_PORT_PIN_MODE_OTHER1 PORT_FUNC2

/* Pad: 122*/
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_122_PORT_PIN_MODE_OTHER PORT_FUNC2

/* Pad: 123*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_123 {37, 1}  /* CS0_4 / DSPI_4Reserved */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_123 {48, 1}  /* E1UC[5] / eMIOS_1 */
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_SPI0 PORT_FUNC2
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_123_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 124*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_124 {32, 1}  /* SCK_3 / DSPI_3 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_124 {51, 1}  /* E1UC[25] / eMIOS_1 */
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_124_PORT_PIN_MODE_OTHER0 PORT_FUNC3

/* Pad: 125*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_125 {34, 1}  /* CS0_3 / DSPI_3 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_125 {52, 1}  /* E1UC[26] / eMIOS_1 */
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_SPI0 PORT_FUNC2
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_125_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 126*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_126 {35, 1}  /* SCK_4 / DSPI_4 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_126 {53, 1}  /* E1UC[27] / eMIOS_1 */
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_SPI PORT_FUNC2
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_126_PORT_PIN_MODE_OTHER0 PORT_FUNC3

