Anyc-Qing/AUTOSAR/core/mcal/Port/inc/MPC5646B_portdefs.h
/* Pad: 127*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_127 {49, 1}  /* E1UC[17] / eMIOS_1 */
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_PWM PORT_FUNC3
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_ICU PORT_FUNC3
#define PIN_FUNCTION_REG_127_PORT_PIN_MODE_OTHER PORT_FUNC3

/* Pad: 128*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_128 {40, 1}  /* E0UC[28] / eMIOS_0 */
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_128_PORT_PIN_MODE_LIN PORT_FUNC2

/* Pad: 129*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_129 {41, 1}  /* E0UC[29] / eMIOS_0 */
#define INPUT_SELECT_PORT_PIN_MODE_LIN_PAD_129 {61, 1}  /* LIN8RX / LINFlex _8 */
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_129_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 130*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_130 {42, 2}  /* E0UC[30] / eMIOS_0 */
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_130_PORT_PIN_MODE_LIN PORT_FUNC2

/* Pad: 131*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_131 {43, 2}  /* E0UC[31] / eMIOS0 */
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_OTHER0 PORT_FUNC0
#define PIN_FUNCTION_REG_131_PORT_PIN_MODE_LIN PORT_FUNC0

/* Pad: 132*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_132 {54, 1}  /* E1UC[28] / eMIOS_1 */
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_132_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 133*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_133 {35, 2}  /* SCK_4 / DSPI_4 */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_133 {55, 1}  /* E1UC[29] / eMIOS_1 */
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_133_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 134*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_134 {37, 2}  /* CS0_4 / DSPI_4Reserved */
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_134 {56, 2}  /* E1UC[30] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_134_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 135*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_135 {57, 2}  /* E1UC[31] / eMIOS_1Reserved */
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_PWM PORT_FUNC1
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_ICU PORT_FUNC1
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_135_PORT_PIN_MODE_SPI PORT_FUNC2

/* Pad: 136*/
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_136_PORT_PIN_MODE_OTHER PORT_GPIO_APC

/* Pad: 137*/
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_137_PORT_PIN_MODE_OTHER PORT_GPIO_APC

/* Pad: 138*/
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_138_PORT_PIN_MODE_OTHER PORT_GPIO_APC

/* Pad: 139*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_139 {33, 1}  /* SIN_3 / DSPI_3 */
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_139_PORT_PIN_MODE_SPI PORT_FUNC0

/* Pad: 140*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_140 {34, 2}  /* CS0_3 / DSPI_3 */
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_140_PORT_PIN_MODE_OTHER PORT_GPIO_APC

/* Pad: 141*/
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_141_PORT_PIN_MODE_OTHER PORT_GPIO_APC

/* Pad: 142*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_142 {36, 1}  /* SIN_4 / DSPI_4Reserved */
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_142_PORT_PIN_MODE_SPI PORT_FUNC0

/* Pad: 143*/
#define INPUT_SELECT_PORT_PIN_MODE_SPI_PAD_143 {37, 3}  /* CS0_4 / DSPI_4Reserved */
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_143_PORT_PIN_MODE_OTHER PORT_GPIO_APC

/* Pad: 144*/
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_144_PORT_PIN_MODE_OTHER PORT_GPIO_APC

/* Pad: 145*/
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_OTHER PORT_GPIO_APC
#define PIN_FUNCTION_REG_145_PORT_PIN_MODE_SPI PORT_FUNC0

/* Pad: 146*/
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_146_PORT_PIN_MODE_OTHER PORT_GPIO_APC

