Anyc-Qing/AUTOSAR/core/mcal/Port/inc/MPC5646B_portdefs.h
/* Pad: 147*/
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_SPI PORT_FUNC1
#define PIN_FUNCTION_REG_147_PORT_PIN_MODE_OTHER PORT_GPIO_APC

/* Pad: 148*/
#define INPUT_SELECT_PORT_PIN_MODE_ICU_PAD_148 {50, 1}  /* E1UC[18] / eMIOS_1 */
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_DIO PORT_FUNC0
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER PORT_FUNC1
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_PWM PORT_FUNC2
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_ICU PORT_FUNC2
#define PIN_FUNCTION_REG_148_PORT_PIN_MODE_OTHER0 PORT_FUNC2

/* Pad: 149 and higher only for 256 BGA */
#define PIN_FUNCTION_REG_149_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 150*/
#define PIN_FUNCTION_REG_150_PORT_PIN_MODE_DIO PORT_FUNC0


/* Pad: 151*/
#define PIN_FUNCTION_REG_151_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 152*/
#define PIN_FUNCTION_REG_152_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 153*/
#define PIN_FUNCTION_REG_153_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 154*/
#define PIN_FUNCTION_REG_154_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 155*/
#define PIN_FUNCTION_REG_155_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 156*/
#define PIN_FUNCTION_REG_156_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 157*/
#define PIN_FUNCTION_REG_157_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 158*/
#define PIN_FUNCTION_REG_158_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 159*/
#define PIN_FUNCTION_REG_159_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 160*/
#define PIN_FUNCTION_REG_160_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 161*/
#define PIN_FUNCTION_REG_161_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 162*/
#define PIN_FUNCTION_REG_162_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 163*/
#define PIN_FUNCTION_REG_163_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 164*/
#define PIN_FUNCTION_REG_164_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 165*/
#define PIN_FUNCTION_REG_165_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 166*/
#define PIN_FUNCTION_REG_166_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 167*/
#define PIN_FUNCTION_REG_167_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 168*/
#define PIN_FUNCTION_REG_168_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 169*/
#define PIN_FUNCTION_REG_169_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 170*/
#define PIN_FUNCTION_REG_170_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 171*/
#define PIN_FUNCTION_REG_171_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 172*/
#define PIN_FUNCTION_REG_172_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 173*/
#define PIN_FUNCTION_REG_173_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 174*/
#define PIN_FUNCTION_REG_174_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 175*/
#define PIN_FUNCTION_REG_175_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 176*/
#define PIN_FUNCTION_REG_176_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 177*/
#define PIN_FUNCTION_REG_177_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 178*/
#define PIN_FUNCTION_REG_178_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 179*/
#define PIN_FUNCTION_REG_179_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 180*/
#define PIN_FUNCTION_REG_180_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 181*/
#define PIN_FUNCTION_REG_181_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 182*/
#define PIN_FUNCTION_REG_182_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 183*/
#define PIN_FUNCTION_REG_183_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 184*/
#define PIN_FUNCTION_REG_184_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 185*/
#define PIN_FUNCTION_REG_185_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 186*/
#define PIN_FUNCTION_REG_186_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 187*/
#define PIN_FUNCTION_REG_187_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 188*/
#define PIN_FUNCTION_REG_188_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 189*/
#define PIN_FUNCTION_REG_189_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 190*/
#define PIN_FUNCTION_REG_190_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 191*/
#define PIN_FUNCTION_REG_191_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 192*/
#define PIN_FUNCTION_REG_192_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 193*/
#define PIN_FUNCTION_REG_193_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 194*/
#define PIN_FUNCTION_REG_194_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 195*/
#define PIN_FUNCTION_REG_195_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 196*/
#define PIN_FUNCTION_REG_196_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 197*/
#define PIN_FUNCTION_REG_197_PORT_PIN_MODE_DIO PORT_FUNC0

/* Pad: 198*/
#define PIN_FUNCTION_REG_198_PORT_PIN_MODE_DIO PORT_FUNC0

#endif  /* _MPC5646BPORTS_H*/ 
